; ==============================================================================
; SETTINGS =ru= НАСТРОЙКИ
; ==============================================================================
; FileDescription: Settings for Keybord_Assistant =ru= Настроки для Keybord_Assistant
; FileVersion: 2.0.0.0 2020-08-03 \\ (Major version).(Minor version).(Revision number).(Build number) (year)-(month)-(day)
; Author: kaiu@mail.ru \\ author of code changes 
; ProductName: Keybord_Assistant \\ included in the product
; OriginalFilename: settings.ini \\ What file is this code from
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; IMPORTANT! Use UTF16 LE file format with BOM (Notepad++ can edit such a file https://notepad-plus-plus.org/) 
; =ru= ВАЖНО! Использовать формат файла UTF16 LE with BOM (редактировать такой файл умеет Notepad++ https://notepad-plus-plus.org/) 
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; You can run the program with different settings stored in different *.ini files (just don't name settings.ini)
;   why in the shortcut to the program write the name of the ini file after Keybord_Assistant.exe, example: Keybord_Assistant.exe my.ini
; The ini files must be in the same directory as Keybord_Assistant.exe
; =ru= Вы можете запускать программу с разными настройками сохраненными в разных файлах *.ini (только не называйте settings.ini)
; =ru=   для чего в ярлыке к программе пропишите после Keybord_Assistant.exe имя ini файла, пример: Keybord_Assistant.exe my.ini
; =ru= Файлы ini должны лежать в этом же каталоге, что и Keybord_Assistant.exe 
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; Save after changing the settings. To display the changes, restart the Keybord_Assistant.exe program
; =ru= После изменения настроек сохранитесь. Для отображения изменений перезагрузите программу Keybord_Assistant.exe  
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
[MAIN]
; localization file from "localization" directory (program language)
; =ru= файл локализации из каталога "localization" (язык программы)
FileLocalization=English.ini

; Help file (*.jpg or *.txt or *.pdf or ...) NAME.EXT (if not found, search by NAME_FileLocalization.EXT or by NAME_English.EXT)
; =ru= Файл справки (*.jpg or *.txt or *.pdf or ...) NAME.EXT (если не найдет, то поиск по NAME_FileLocalization.EXT или по NAME_English.EXT) 
HelpFile=help\Help.jpg

; Is language tooltip allowed (1-yes, 0-no)
; =ru= Разрешена ли всплывающая подсказка по языку (1-да, 0-нет)
ShowToolTip=1

; Is it allowed to play the layout switching sound
; =ru= Разрешено ли проигрывать звук переключения раскладки
PlaySound=1

; Sound level at startup =ru= Уровень звука при запуске
; =1 or 2 or 3
SoundLevelAtStartup=1

; time to switch layout [ms] (200 ... 500)
; =ru= время на переключение раскладки [mS] (200 ... 500)
TimeSwitchLayout=250

; Toggle CapsLock by simultaneously pressing LShift + RShift (1-yes, 0-no)
; =ru= Переключать CapsLock одновременным нажатием LShift + RShift (1-да, 0-нет)
LShift_RShift_CapsLock=1

; time to switch CapsLock [ms] (300 ... 500)
; =ru= время на переключение CapsLock [mS] (300 ... 500)
TimeSwitchCapsLock=300

; sound files for voicing CapsLock switching (in the catalog "sound")
; =ru= звуковые файлы для озвучивания переключения CapsLock (в каталоге "sound")
FileSoundCapsLockON=CapsLockON.wav
FileSoundCapsLockOFF=CapsLockOFF.wav
; sound files to sound sticky mouse (in the catalog "sound")
; =ru= звуковые файлы для озвучивания залипания мыши (в каталоге "sound")
FileSoundMouseStuckOFF=StuckOFF.wav
FileSoundMouseStuckON=StuckON.wav

; test mode (1-yes, 0-no) (*F12 - show sticky keys, RWin+F1 = ListHotkeys)
; =ru= режим тестирования (1-да, 0-нет) (*F12 - показ залипших клавиш, RWin+F1 = ListHotkeys)
TestMode=0


; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; all your layouts in the system (on each line there is one entry like: HKL, ISO, Name, Sound, INPUT_LNG, LAYOUT_NAME)
; it is important to set a short unique Name as it is shown to you when you switch to this layout
; and change if required Sound - the name of the file in the Sound folder for sounding
; =ru= все ваши раскладки в системе (на каждой строке одна запись вида: HKL, ISO, Name, Sound, INPUT_LNG, LAYOUT_NAME) 
; =ru= важно задать краткое уникальное имя Name, так как оно показывается вам при переключении в эту раскладку
; =ru= и измените если требуется Sound - имя файла в папке Sound для озвучивания 
;      HKL,  ISO, Name, Sound, INPUT_LNG, LAYOUT_NAME 
[PLACE_FOR_SECTION_KEYBOARDS]
[KEYBOARDS]
0x04090409, en_US, EN, 01.wav, Английский (США), US
0x04190419, ru_RU, RU, 02.wav, Русский (Россия), Russian
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; Alternative 1 list of layouts (one entry per line: HKL, ISO)
; =ru= Альтернативный 1 список раскладок  (на каждой строке одна запись вида: HKL, ISO)
[LAYOUT_LIST_1]
0x04190419, ru_RU
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; Alternative 2 list of layouts (one entry per line: HKL, ISO)
; =ru= Альтернативный 2 список раскладок  (на каждой строке одна запись вида: HKL, ISO)
[LAYOUT_LIST_2]
0x04090409, en_US
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; Alternative 3 list of layouts (one entry per line: HKL, ISO)
; =ru= Альтернативный 3 список раскладок  (на каждой строке одна запись вида: HKL, ISO)
[LAYOUT_LIST_3]
0x04190419, ru_RU
0x04090409, en_US
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; Alternative 4 list of layouts (one entry per line: HKL, ISO)
; =ru= Альтернативный 4 список раскладок  (на каждой строке одна запись вида: HKL, ISO)
[LAYOUT_LIST_4]
0x04190419, ru_RU
0x04090409, en_US
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; Alternative 5 list of layouts (one entry per line: HKL, ISO)
; =ru= Альтернативный 5 список раскладок  (на каждой строке одна запись вида: HKL, ISO)
[LAYOUT_LIST_5]
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; Alternative 6 list of layouts (one entry per line: HKL, ISO)
; =ru= Альтернативный 6 список раскладок  (на каждой строке одна запись вида: HKL, ISO)
[LAYOUT_LIST_6]
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; Alternative 7 list of layouts (one entry per line: HKL, ISO)
; =ru= Альтернативный 7 список раскладок  (на каждой строке одна запись вида: HKL, ISO)
[LAYOUT_LIST_7]
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; Alternative 8 list of layouts (one entry per line: HKL, ISO)
; =ru= Альтернативный 8 список раскладок  (на каждой строке одна запись вида: HKL, ISO)
[LAYOUT_LIST_8]
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−   
[CAPSLOCK_OPTIONS]
; Ability to change the default behavior of CapsLock
; (in any case, you can switch by pressing Alt + CapsLock)
; Can only take one of the following values:
; =ru= Возможность изменить стандартное поведение CapsLock
; =ru= (в любом случае, вы можете переключить нажав Alt + CapsLock)
; =ru= Может принимать только одно из значений:

; =    - empty or do not change (CapsLockOption will be Disable) =ru= пустое или не менять (CapsLockOption буден отключен)
; =Disable - disable =ru=  отключить
; =LCtrl - like LCtrl =ru=  как LCtrl
; =LShift - like LShift =ru=  как LShift
; =Tab - like Tab (CapsLockOption will be Disable) =ru=  как Tab (CapsLockOption буден отключен)
CapsLockReassign=LCtrl

; =Disable - disable =ru=  отключить
; =AllLayouts - switch all layouts =ru= переключать все раскладки
; =1 or 2 ... 8 (LAYOUT_LIST_1 or LAYOUT_LIST_2...LAYOUT_LIST_8)  switching from an alternative list of layouts =ru= переключение из альтернативного списка раскладок
CapsLockOption=Disable

; If there is CapsLockReassign=LCtrl then check that your keyboard may not work
; keyboard shortcuts LCtrl+Shift+S and LCtrl+LShift+2,w,x (but will be LCtrl+RShift+2,w,x)
; =ru= Если будет CapsLockReassign=LCtrl то проверьте, что на вашей клавиатуре могут не работать
; =ru= комбинации клавиш LCtrl+Shift+S и LCtrl+LShift+2,w,x (но будет LCtrl+RShift+2,w,x)  

; If the system is set to disable CapsLock by Shift, then in the enabled state CapsLock blocks the reassigned CapsLock
; =ru= Если в системе задано отключать CapsLock по Shift, то во включенном состоянии CapsLock блокируются переназначенный CapsLock 

; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−  
[LSHIFT_OPTIONS]
; Ability to change the default behavior of LShift
; Can only take one of the following values:
; =ru= Возможность изменить стандартное поведение LShift
; =ru= Может принимать только одно из значений:

; =    - empty or do not change =ru= пустое или не менять
; =AllLayouts - switch all layouts =ru= переключать все раскладки
; =1 or 2 ... 8 (LAYOUT_LIST_1 or LAYOUT_LIST_2...LAYOUT_LIST_8)  switching from an alternative list of layouts =ru= переключение из альтернативного списка раскладок
LShiftOption=1
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−  
[RSHIFT_OPTIONS]
; Ability to change the default behavior of RShift
; Can only take one of the following values:
; =ru= Возможность изменить стандартное поведение RShift
; =ru= Может принимать только одно из значений:

; =    - empty or do not change =ru= пустое или не менять
; =AllLayouts - switch all layouts =ru= переключать все раскладки
; =1 or 2 ... 8 (LAYOUT_LIST_1 or LAYOUT_LIST_2...LAYOUT_LIST_8)  switching from an alternative list of layouts =ru= переключение из альтернативного списка раскладок
RShiftOption=2
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−   
[LCTRL_OPTIONS]
; Ability to change the default behavior of LCtrl
; Can only take one of the following values:
; =ru= Возможность изменить стандартное поведение LCtrl
; =ru= Может принимать только одно из значений:

; =    - empty or do not change =ru= пустое или не менять
; =Disable - disable =ru=  отключить
; =AllLayouts - switch all layouts =ru= переключать все раскладки
; =1 or 2 ... 8 (LAYOUT_LIST_1 or LAYOUT_LIST_2...LAYOUT_LIST_8)  switching from an alternative list of layouts =ru= переключение из альтернативного списка раскладок
LCtrlOption=
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−   
[RCTRL_OPTIONS]
; Ability to change the default behavior of RCtrl
; Can only take one of the following values:
; =ru= Возможность изменить стандартное поведение RCtrl
; =ru= Может принимать только одно из значений:

; =    - empty or do not change =ru= пустое или не менять
; =Disable - disable =ru=  отключить
; =RAlt - like RAlt =ru=  как RAlt
; =vkB6 - like vkB6 (Launch_App1) =ru=  как vkB6 (Launch_App1)
; =RShift - like RShift =ru=  как RShift
RCtrlReassign=RAlt

; =Disable - disable =ru=  отключить
; =AllLayouts - switch all layouts =ru= переключать все раскладки
; =1 or 2 ... 8 (LAYOUT_LIST_1 or LAYOUT_LIST_2...LAYOUT_LIST_8)  switching from an alternative list of layouts =ru= переключение из альтернативного списка раскладок
RCtrlOption=Disable

; if RCtrlReassign=RAlt and RCtrlOption<>Disable then menu activation by simply clicking on RAlt will not work
; and for this activation use LAlt
; =ru= если RCtrlReassign=RAlt и RCtrlOption<>Disable тогда активация меню по простому нажатию на RAlt не будет
; =ru= и для этой активации используйте LAlt

; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−   
[LALT_SPACE_OPTIONS]
; Ability to change the default behavior of LAlt + Space
; Can only take one of the following values:
; =ru= Возможность изменить стандартное поведение LAlt + Space
; =ru= Может принимать только одно из значений:

; =    - empty or do not change =ru= пустое или не менять
; =AllLayouts - switch all layouts =ru= переключать все раскладки
; =1 or 2 ... 8 (LAYOUT_LIST_1 or LAYOUT_LIST_2...LAYOUT_LIST_8)  switching from an alternative list of layouts =ru= переключение из альтернативного списка раскладок
LAltSpaceOption=4




; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−− 
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−− 
; everything below for the Keybord_Assistant program, and for this the RAlt and RWin keys must be reassigned
; =ru= всё ниже для программы Keybord_Assistant, а для этого должны быть переназначены клавиши RAlt и RWin 
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−− 
[LALT13]
; hot combinations for LAlt+`, LAlt+1 ... LAlt+= generating text (=Disable - disable)
; =ru= горячие комбинации для LAlt+`, LAlt+1 ... LAlt+= генерирующие текст (=Disable - отключить)
; allowed to use character escaping \\ for \ (\r - 0x0D, \n - 0x0A, \t - 0x09, \e - =, \s - Space, \c - comma)
; =ru= можно использовать экранирование символов \\ для \ (\r - 0x0D, \n - 0x0A, \t - 0x09, \e - =, \s - Пробел, \c - запятая)

; are combinations from this section allowed (1-yes, 0-no)
; be sure to turn it off if these combinations are important to you in programs (especially LAlt + 5 ...)
; =ru= разрешены ли комбинации из этой секции (1-да, 0-нет)
; =ru= обязательно отключите, если в программах эти комбинации вам важны (особенно LAlt+5...)
LAlt13_Enable=1

; apostrophe for Ukrainian =ru= апостроф для украинского языка
LAlt0=’

LAlt1=Disable
LAlt2=Disable
LAlt3=Disable
LAlt4=Disable

; currency signs =ru= знаки валют
LAlt5=€
LAlt6=₴
LAlt7=Disable
LAlt8=₽
LAlt9=Disable
LAlt10=Disable

; em dash and en dash U+2002 =ru= длинное тире и короткий пробел U+2002
LAlt11=— 
; non-breaking space, em dash and single space =ru= неразрывный пробел, длинное тире и пробел простой
LAlt12= —\s
; button accent [\] =ru= знак ударения на кнопке [\]
LAlt13=́
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−− 
[RALT_OPTIONS]
; Ability to change the default behavior of RAlt (actually it's Browser_Stop or vkA9)
; Can only take one of the following values:
; =ru= Возможность изменить стандартное поведение RAlt (в реальности это Browser_Stop или vkA9)
; =ru= Может принимать только одно из значений:

; =Disable - disable =ru=  отключить
; =RAlt - like RAlt =ru=  как RAlt
; =RCtrl - like RCtrl =ru=  как RCtrl
RAltReassign=Disable

; =Disable - disable =ru=  отключить
; =AllLayouts - switch all layouts =ru= переключать все раскладки
; =1 or 2 ... 8 (LAYOUT_LIST_1 or LAYOUT_LIST_2...LAYOUT_LIST_8)  switching from an alternative list of layouts =ru= переключение из альтернативного списка раскладок
RAltOption=3

; if RAltReassign=RAlt and RAltOption<>Disable then menu activation by simply clicking on RAlt will not work
; and for this activation use LAlt
; =ru= если RAltReassign=RAlt и RAltOption<>Disable тогда активация меню по простому нажатию на RAlt не будет
; =ru= и для этой активации используйте LAlt


; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; only for RAltReassign = Disable
; =ru= только для RAltReassign = Disable
; Are additional functionality extensions allowed? (1-yes, 0-no)
; cursor control, mouse control, additional characters ( RAlt+Q (RAlt+Shift+Q) ... )
; =ru= разрешены ли дополнительные расширения функционала? (1-да, 0-нет) 
; =ru= управление курсором, управлению мышью, дополнительные символы ( RAlt+Q (RAlt+Shift+Q) ... )
RAltAddCursor=1
RAltAddMouse=1
RAltAddChars=1

; hot combinations for RAlt+Q (RAlt+Shift+Q) ... generating text (=Disable - disable)
; =ru= горячие комбинации для RAlt+Q (RAlt+Shift+Q) ... генерирующие текст (=Disable - отключить)
; allowed to use character escaping \\ for \ (\r - 0x0D, \n - 0x0A, \t - 0x09, \e - =, \s - Space, \c - comma)
; =ru= можно использовать экранирование символов \\ для \ (\r - 0x0D, \n - 0x0A, \t - 0x09, \e - =, \s - Пробел, \c - запятая)
RAlt_Shift_1=°
RAlt_Shift_2=«
RAlt_Shift_3=»
RAlt_Q=ї
RAlt_Shift_Q=Ї
RAlt_W=ӂ
RAlt_Shift_W=Ӂ
RAlt_A=ў
RAlt_Shift_A=Ў
RAlt_Z=ґ
RAlt_Shift_Z=Ґ
RAlt_X=є
RAlt_Shift_X=Є
RAlt_C=,\s
RAlt_Shift_C=;\s
RAlt_B=і
RAlt_Shift_B=І
; non-breaking space U+00A0 =ru= неразрывный пробел U+00A0
RAlt_Space= 
; non-breaking space (NARROW NO-BREAK SPACE) U+202F =ru= узкий неразрывный пробел U+202F
RAlt_Shift_Space= 
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−− 
[RWIN_OPTIONS]
; Ability to change the default behavior of RWin (actually it's Launch_App1 or vkB6) 
; Can only take one of the following values:
; =ru= Возможность изменить стандартное поведение RWin (в реальности это Launch_App1 или vkB6)
; =ru= Может принимать только одно из значений:

; =Disable - disable =ru=  отключить
; =RWin - like RWin =ru=  как RWin
; =RAlt - like RAlt =ru=  как RAlt
; =RCtrl - like RCtrl =ru=  как RCtrl
RWinReassign=Disable

; =Disable - disable =ru=  отключить
; =AllLayouts - switch all layouts =ru= переключать все раскладки
; =1 or 2 ... 8 (LAYOUT_LIST_1 or LAYOUT_LIST_2...LAYOUT_LIST_8)  switching from an alternative list of layouts =ru= переключение из альтернативного списка раскладок
RWinOption=Disable

; if RWinReassign=RAlt and RWinOption<>Disable then menu activation by simply clicking on RAlt will not work
; and for this activation use LAlt
; =ru= если RWinReassign=RAlt и RWinOption<>Disable тогда активация меню по простому нажатию на RAlt не будет
; =ru= и для этой активации используйте LAlt

; if RWinReassign=RWin and RWinOption<>Disable then activation of the START button by simply pressing RWin will not work
; and for this activation use LWin
; =ru= если RWinReassign=RWin и RWinOption<>Disable тогда активация кнопки ПУСК по простому нажатию на RWin не будет 
; =ru= и для этой активации используйте LWin


; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; only for RWinReassign = Disable   !!!
; =ru= только для RWinReassign = Disable  !!!
; whether Birman Layout is allowed (1-yes, 0-no)
; =ru= разрешена ли Раскладка Бирмана (1-да, 0-нет)
RWinBirmanLayout=1
; short space (EN SPACE) U+2002 =ru= короткий пробел U+2002
RWin_Space= 
; non-breaking space (FIGURE SPACE) U+2007 =ru= неразрывный пробел (как у цифр и для набора таблиц) U+2007
RWin_Shift_Space= 
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−− 
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−− 
[ADDITIONALLY]
; Paste text without formatting by Ctrl+Alt+V (1-yes, 0-no)
; =ru= Вставка текста без форматирования по Ctrl+Alt+V  (1-да, 0-нет) 
Ctrl_Alt_V=1


; change case to lower by Alt+Pause (upper Alt+Shift+Pause)
; =ru= изменить регистр на нижний по Alt+Pause (верхний Alt+Shift+Pause)
Alt_Pause=1


; translit_1 (highlighted text) (1-yes, 0-no)
; =ru= транслит_1 (выделенный текст) (1-да, 0-нет) 
Alt_ScrollLock=1


; transliteration file from "translit_1" directory
; =ru= файл транслитерации из каталога "translit_1"
FileTranslit_1=Cyr_to_Eng.ini


; translit_2 (highlighted text). Usually into valid filenames (1-yes, 0-no)
; =ru= транслит_2 (выделенный текст). Обычно в допустимые имена файлов (1-да, 0-нет) 
Alt_Shift_ScrollLock=1


; transliteration file from "translit_2" directory
; =ru= файл транслитерации из каталога "translit_2"
FileTranslit_2=Cyr_to_FileNameEng.ini


; Special transliteration for the Alt_Win_ScrollLock.ini file in the folder "translit_2" (1-yes, 0-no)
; Initially, this file implements the translation of the Moldovan Cyrillic alphabet into the Romanian Latin alphabet
; But you can change to your preference.
; =ru= Специальная транслитерация файла Alt_Win_ScrollLock.ini в папке "translit_2" (1-да, 0-нет)
; =ru= Изначально этот файл реализует перевод молдавской кириллицы в румынскую латиницу.
; =ru= Но вы можете изменить на своё усмотрение.
Alt_Win_ScrollLock=1


; Made a mistake with the language and have already started typing?
; Switch to the layout you need and press this key combination.
; Characters will be retyped (only up to a Space or Enter)
; Enable this functionality if it is really very important to you and you often make mistakes. (1-yes, 0-no)
; It is not desirable and not safe to accustom yourself to mistakes!
; =en= Correct switching for all layouts is not guaranteed!
; =ru= Ошиблись с языком и уже начали набирать?
; =ru= Переключитесь в нужную вам раскладку и нажмите эту комбинацию клавиш.
; =ru= Произойдет перенабор символов (только до пробела или Enter )
; =ru= Включите этот функционал если действительно вам это очень важно и вы часто ошибаетесь. (1-да, 0-нет)
; =ru= Не желательно и не безопасно приучать себя к ошибкам!
; =ru= Не гарантируется корректное переключение для всех раскладок!
RAlt_BackSpace=0

; ==============================================================================